###############################################################################
# Created by write_sdc
###############################################################################
current_design croctop
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk_sys -period 20.0000 [get_ports {clk_i}]
set_clock_transition 0.1500 [get_clocks {clk_sys}]
set_clock_uncertainty 0.2500 clk_sys
set_propagated_clock [get_clocks {clk_sys}]
create_clock -name clk_jtg -period 25.0000 [get_ports {jtag_inputs_PAD[0]}]
set_clock_transition 0.1500 [get_clocks {clk_jtg}]
set_clock_uncertainty 0.2500 clk_jtg
set_propagated_clock [get_clocks {clk_jtg}]
create_clock -name clk_rtc -period 50.0000 [get_ports {ref_clk_i}]
set_clock_transition 0.1500 [get_clocks {clk_rtc}]
set_clock_uncertainty 0.2500 clk_rtc
set_propagated_clock [get_clocks {clk_rtc}]
set_clock_groups -name clk_groups_async -asynchronous \
 -group [get_clocks {clk_jtg}]\
 -group [get_clocks {clk_rtc}]\
 -group [get_clocks {clk_sys}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {fetch_en_i}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {fetch_en_i}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[0]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[10]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[10]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[11]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[11]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[12]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[12]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[13]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[13]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[14]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[14]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[15]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[15]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[16]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[16]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[17]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[17]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[18]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[18]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[19]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[19]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[1]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[20]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[20]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[21]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[21]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[22]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[22]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[23]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[23]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[24]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[24]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[25]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[25]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[26]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[26]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[27]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[27]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[28]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[28]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[29]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[29]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[2]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[30]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[30]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[31]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[31]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[3]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[4]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[5]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[6]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[7]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[8]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[8]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {gpio_io[9]}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {gpio_io[9]}]
set_input_delay 0.0000 -clock [get_clocks {clk_jtg}] -min -add_delay [get_ports {jtag_inputs_PAD[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk_jtg}] -max -add_delay [get_ports {jtag_inputs_PAD[1]}]
set_input_delay 0.0000 -clock [get_clocks {clk_jtg}] -min -add_delay [get_ports {jtag_inputs_PAD[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk_jtg}] -max -add_delay [get_ports {jtag_inputs_PAD[2]}]
set_input_delay 0.0000 -clock [get_clocks {clk_jtg}] -min -add_delay [get_ports {jtag_inputs_PAD[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk_jtg}] -max -add_delay [get_ports {jtag_inputs_PAD[3]}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {rst_ni}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {rst_ni}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {uart_rx_i}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {uart_rx_i}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[10]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[11]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[12]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[13]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[14]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[15]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[16]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[17]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[18]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[19]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[20]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[21]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[22]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[23]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[24]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[25]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[26]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[27]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[28]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[29]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[30]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[31]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[8]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {gpio_io[9]}]
set_output_delay 5.0000 -clock [get_clocks {clk_jtg}] -add_delay [get_ports {jtag_tdo_o}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {status_o}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {uart_tx_o}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {unused_o[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {unused_o[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {unused_o[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -add_delay [get_ports {unused_o[3]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0060 [get_ports {clk_i}]
set_load -pin_load 0.0060 [get_ports {fetch_en_i}]
set_load -pin_load 0.0060 [get_ports {jtag_tdo_o}]
set_load -pin_load 0.0060 [get_ports {ref_clk_i}]
set_load -pin_load 0.0060 [get_ports {rst_ni}]
set_load -pin_load 0.0060 [get_ports {status_o}]
set_load -pin_load 0.0060 [get_ports {uart_rx_i}]
set_load -pin_load 0.0060 [get_ports {uart_tx_o}]
set_load -pin_load 0.0060 [get_ports {gpio_io[31]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[30]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[29]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[28]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[27]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[26]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[25]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[24]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[23]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[22]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[21]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[20]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[19]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[18]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[17]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[16]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[15]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[14]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[13]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[12]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[11]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[10]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[9]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[8]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[7]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[6]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[5]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[4]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[3]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[2]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[1]}]
set_load -pin_load 0.0060 [get_ports {gpio_io[0]}]
set_load -pin_load 0.0060 [get_ports {jtag_inputs_PAD[3]}]
set_load -pin_load 0.0060 [get_ports {jtag_inputs_PAD[2]}]
set_load -pin_load 0.0060 [get_ports {jtag_inputs_PAD[1]}]
set_load -pin_load 0.0060 [get_ports {jtag_inputs_PAD[0]}]
set_load -pin_load 0.0060 [get_ports {unused_o[3]}]
set_load -pin_load 0.0060 [get_ports {unused_o[2]}]
set_load -pin_load 0.0060 [get_ports {unused_o[1]}]
set_load -pin_load 0.0060 [get_ports {unused_o[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 8.0000 [current_design]
