###############################################################################
# Created by write_sdc
###############################################################################
current_design top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk_PAD -period 10.0000 [get_ports {clk_PAD}]
set_clock_transition 0.1500 [get_clocks {clk_PAD}]
set_clock_uncertainty 0.2500 clk_PAD
set_propagated_clock [get_clocks {clk_PAD}]
set_input_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {in_data_PADs[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {in_data_PADs[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {in_data_PADs[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {in_data_PADs[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {in_data_PADs[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {in_data_PADs[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {in_data_PADs[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {in_data_PADs[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {in_valid_PAD}]
set_input_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {out_ready_PAD}]
set_input_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {rst_n_PAD}]
set_output_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {in_data_PADs[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {in_data_PADs[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {in_data_PADs[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {in_data_PADs[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {in_data_PADs[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {in_data_PADs[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {in_data_PADs[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {in_data_PADs[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {in_ready_PAD}]
set_output_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {in_valid_PAD}]
set_output_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {out_data_PADs[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {out_data_PADs[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {out_data_PADs[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {out_data_PADs[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {out_data_PADs[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {out_data_PADs[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {out_data_PADs[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {out_data_PADs[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {out_ready_PAD}]
set_output_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {out_valid_PAD}]
set_output_delay 2.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {rst_n_PAD}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0060 [get_ports {clk_PAD}]
set_load -pin_load 0.0060 [get_ports {in_ready_PAD}]
set_load -pin_load 0.0060 [get_ports {in_valid_PAD}]
set_load -pin_load 0.0060 [get_ports {out_ready_PAD}]
set_load -pin_load 0.0060 [get_ports {out_valid_PAD}]
set_load -pin_load 0.0060 [get_ports {rst_n_PAD}]
set_load -pin_load 0.0060 [get_ports {in_data_PADs[7]}]
set_load -pin_load 0.0060 [get_ports {in_data_PADs[6]}]
set_load -pin_load 0.0060 [get_ports {in_data_PADs[5]}]
set_load -pin_load 0.0060 [get_ports {in_data_PADs[4]}]
set_load -pin_load 0.0060 [get_ports {in_data_PADs[3]}]
set_load -pin_load 0.0060 [get_ports {in_data_PADs[2]}]
set_load -pin_load 0.0060 [get_ports {in_data_PADs[1]}]
set_load -pin_load 0.0060 [get_ports {in_data_PADs[0]}]
set_load -pin_load 0.0060 [get_ports {out_data_PADs[7]}]
set_load -pin_load 0.0060 [get_ports {out_data_PADs[6]}]
set_load -pin_load 0.0060 [get_ports {out_data_PADs[5]}]
set_load -pin_load 0.0060 [get_ports {out_data_PADs[4]}]
set_load -pin_load 0.0060 [get_ports {out_data_PADs[3]}]
set_load -pin_load 0.0060 [get_ports {out_data_PADs[2]}]
set_load -pin_load 0.0060 [get_ports {out_data_PADs[1]}]
set_load -pin_load 0.0060 [get_ports {out_data_PADs[0]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_PAD}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_valid_PAD}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {out_ready_PAD}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n_PAD}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_data_PADs[7]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_data_PADs[6]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_data_PADs[5]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_data_PADs[4]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_data_PADs[3]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_data_PADs[2]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_data_PADs[1]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_data_PADs[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 10.0000 [current_design]
